//=============================================================================
//
// 炎クラス [fire.cpp]
// Author : Konishi Yuuto
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include "fire.h"
#include "renderer.h"
#include "manager.h"
#include "player.h"
#include "texture.h"
#include "resource_manager.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define SCALE_DOWN		(0.1f)		// 縮小の値
#define ALPHA_NUM		(0.05f)		// 透明度の値

//=============================================================================
// インスタンス生成
//=============================================================================
CFire * CFire::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size, int nLife)
{
	// インスタンス生成
	CFire *pFire = new CFire;

	// nullchack
	if (pFire != nullptr)
	{

		// 距離の設定
		int nDis =
			rand() % FIRE_DISTANCE + rand() % FIRE_DISTANCE - rand() % FIRE_DISTANCE - rand() % FIRE_DISTANCE;

		// ランダムで出現を決める
		D3DXVECTOR3 TargetPos = D3DXVECTOR3(pos.x + nDis,
			pos.y + nDis, pos.z + nDis);

		// 初期化処理
		pFire->Init(TargetPos, size);

		// 速度の設定
		int nSpeed = 0;
		nSpeed += rand() % 4 + rand() % 4 + rand() % 4;

		// 移動量
		D3DXVECTOR3 move = D3DXVECTOR3(0.0f, (float)nSpeed, 0.0f);

		// 移動量
		pFire->SetMove(move);

		// ライフの設定
		pFire->SetLife(nLife);
	}

	return pFire;
}

//=============================================================================
// コンストラクタ
//=============================================================================
CFire::CFire()
{
	m_nLife = 0;
	m_fScale = 0.0f;
	m_fScaleNum = 0.0f;
	m_fAlpha = 0.0f;
	m_fAlphaNum = 0.0f;
}

//=============================================================================
// デストラクタ
//=============================================================================
CFire::~CFire()
{

}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CFire::Init(D3DXVECTOR3 pos, D3DXVECTOR3 size)
{
	// 初期化処理
	CBillboard::Init(pos, size);

	CTexture *pTexture = GET_TEXTURE_PTR;

	// テクスチャの設定
	BindTexture(pTexture->GetTexture(CTexture::TEXTURE_NUM_FIRE));

	// 縮小
	m_fScaleNum = SCALE_DOWN;

	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void CFire::Uninit(void)
{
	// 終了処理
	CBillboard::Uninit();
}

//=============================================================================
// 更新処理
//=============================================================================
void CFire::Update(void)
{
	// ライフ減算
	m_nLife--;

	// 更新処理
	CBillboard::Update();

	// 縮小の処理
	ScaleDown();

	// ライフが0になったら
	if (m_nLife <= 0)
	{
		// 終了処理
		Uninit();

		return;
	}
}

//=============================================================================
// 描画処理
//=============================================================================
void CFire::Draw(void)
{
	// 2Dポリゴン描画処理
	CBillboard::Draw();
}

//=============================================================================
// カラーの設定
//=============================================================================
void CFire::SetColor(D3DXCOLOR col)
{
	// 頂点情報を設定
	VERTEX_2D *pVtx;

	// 頂点バッファをロックし、頂点情報へのポインタを取得
	GetVtxBuff()->Lock(0, 0, (void**)&pVtx, 0);

	// 頂点カラーの設定
	pVtx[0].col = D3DCOLOR_RGBA(255, 100, 0, 255);	// 左上頂点の色	透明度255
	pVtx[1].col = D3DCOLOR_RGBA(255, 100, 0, 255);	// 右上頂点の色	透明度255
	pVtx[2].col = D3DCOLOR_RGBA(255, 100, 0, 255);	// 左下頂点の色	透明度255
	pVtx[3].col = D3DCOLOR_RGBA(255, 100, 0, 255);	// 右下頂点の色	透明度255

	// 頂点バッファをアンロックする
	GetVtxBuff()->Unlock();
}

//=============================================================================
// ライフの設定
//=============================================================================
void CFire::SetLife(int nLife)
{
	// ライフの設定をランダムで
	m_nLife = nLife - rand() % 30;
}

//=============================================================================
// 縮小
//=============================================================================
void CFire::ScaleDown(void)
{
	// サイズ受け取り
	D3DXVECTOR3 size = GetSize();

	size.x -= m_fScaleNum;
	size.y -= m_fScaleNum;

	// サイズ受け渡し
	SetSize(size);
}