//=============================================================================
//
// ライフゲージの枠 [life_frame.cpp]
// Author : Konishi Yuuto
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include "life_frame.h"
#include "renderer.h"
#include "manager.h"
#include "texture.h"
#include "resource_manager.h"

//=============================================================================
// コンストラクタ
//=============================================================================
CLifeFrame::CLifeFrame(PRIORITY Priority) : CUi(Priority)
{

}

//=============================================================================
// デストラクタ
//=============================================================================
CLifeFrame::~CLifeFrame()
{

}

//=============================================================================
// オブジェクト生成
//=============================================================================
CLifeFrame *CLifeFrame::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size)
{
	// メモリ確保
	CLifeFrame *pLifeFrame = new CLifeFrame;

	// 初期化処理
	pLifeFrame->Init(pos, size);

	return S_OK;
}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CLifeFrame::Init(D3DXVECTOR3 pos, D3DXVECTOR3 size)
{
	// 初期化処理
	CUi::Init(pos, size);												// 座標、サイズ

	CTexture *pTexture = CManager::GetResourceManager()->GetTextureClass();
	BindTexture(pTexture->GetTexture(CTexture::TEXTURE_NUM_GAGEFLAME));	// テクスチャ設定

	return S_OK;
}