#ifndef _ROAR_EFFECT_H_
#define _ROAR_EFFECT_H_
//=============================================================================
//
// 咆哮時の炎クラスヘッダー [roar_effect.h]
// Author : Konishi Yuuto
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include "billboard.h"

//=============================================================================
// 前方宣言
//=============================================================================
class CBillboard;

//=============================================================================
// BGクラス
//=============================================================================
class CRoarFire : public CBillboard
{
public:
	CRoarFire(PRIORITY Priority = PRIORITY_PARTICLE);	// コンストラクタ
	~CRoarFire();										// デストラクタ

	HRESULT Init(D3DXVECTOR3 pos, D3DXVECTOR3 size);	// 初期化処理
	void Uninit(void);									// 終了処理
	void Update(void);									// 更新処理
	void Draw(void);									// 描画処理

	static CRoarFire * Create(							// ポリゴン生成
		D3DXVECTOR3 pos, D3DXVECTOR3 size);

	void Collision(void);								// 当たり判定の関数
private:
	int m_nCounter;			// クラスのフレームカウンター
};

#endif