//=============================================================================
//
// スキルのUIクラス [ui_skill.cpp]
// Author : Konishi Yuuto
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include "ui_skill.h"
#include "manager.h"
#include "renderer.h"
#include "resource_manager.h"
#include "texture.h"
#include "resource_manager.h"

//=============================================================================
// オブジェクト生成
//=============================================================================
CUiSkill* CUiSkill::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size, bool bUse)
{
	// オブジェクトを生成
	CUiSkill* pUiSkill = new CUiSkill;

	// 初期化処理
	pUiSkill->Init(pos, size);
	pUiSkill->SetUse(bUse);

	return pUiSkill;
}

//=============================================================================
// コンストラクタ
//=============================================================================
CUiSkill::CUiSkill()
{
}

//=============================================================================
// デストラクタ
//=============================================================================
CUiSkill::~CUiSkill()
{

}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CUiSkill::Init(D3DXVECTOR3 pos, D3DXVECTOR3 size)
{
	// 初期化処理
	CUi::Init(pos, size);												// 座標、サイズ

	// テクスチャポインタ
	CTexture *pTexture = CManager::GetResourceManager()->GetTextureClass();

	// テクスチャの設定
	BindTexture(pTexture->GetTexture(CTexture::TEXTURE_NUM_SKILL_UI));

	return S_OK;
}

//================================================
// 終了処理
//================================================
void CUiSkill::Uninit(void)
{
	// 終了処理
	CUi::Uninit();
}

//================================================
// 更新処理
//================================================
void CUiSkill::Update(void)
{
	// 更新処理
	CUi::Update();
}

//================================================
// 描画処理
//================================================
void CUiSkill::Draw(void)
{
	// フラグがあれば
	if (GetUse() == true)
	{
		// 描画処理
	//	CUi::Draw();
	}
}